Revit 2025 API
Zone.ServiceType Property
Get or set the Service Type of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public ServiceType ServiceType { get; set; }
Public Property ServiceType As ServiceType
	Get
	Set
public:
property ServiceType ServiceType {
	ServiceType get ();
	void set (ServiceType value);
}
member ServiceType : ServiceType with get, set
Property Value
ServiceType
Remarks
This property is used to get or set the Service Type of the Zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace